/* The title of the button for aborting the scanning of Audio Units. */
"Abort" = "Megszakítás";

/* alert button
   dialog confirmation */
"OK" = "OK";

/* alert button */
"Abort scan" = "Szkennelés megszakítása";

/* alert button */
"Continue" = "Folytatás";

/* alert button */
"Continue scan" = "Vizsgálat folytatása";

/* alert button */
"Ignore" = "Kihagyás";

/* alert button */
"Ignore plug-in" = "Plugin figyelmen kívül hagyása";

/* alert button */
"Open plug-in graphic interface" = "A plugin grafikus felületének megnyitása";

/* alert button */
"Start Plug-In Manager" = "Pluginkezelő elindítása";

/* alert text */
"Dear ^P user,\nyou have %ld Audio Unit(s) enabled which did not pass the Apple AU validation. This may cause problems and can even crash ^P or lead to data loss! Please check with the manufacturer(s) for updated versions. We recommend disabling these plug-ins in the Plug-In Manager." = "Kedves ^P felhasználó!\nRendelkezik %ld engedélyezett Audio Unittal, amelyek nem felelnek meg az Apple AU-érvényesítésnek. Előfordulhat, hogy ez problémákat okos, a(z) ^P összeomlását eredményezi, vagy adatvesztéshez vezet! Egyeztessen a gyártóval vagy gyártókkal a frissítési verziókról. Azt ajánljuk, hogy tiltsa le ezeket a pluginokat a Pluginkezelőben.";

/* alert text */
"Only Audio Units that have been successfully scanned will be available in ^P.\nScanning will continue next time you launch ^P." = "Csak a sikeresen megvizsgált Audio Units elemek lesznek elérhetők a(z) ^P alkalmazásban.\nA(z) ^P legközelebbi indításakor folytatódni fog a vizsgálat.";

/* alert text */
"The Audio Unit “%@” by “%@” reports that it is not properly authorized to be used on this system.\nPlease check the plug-in’s documentation for more information about its copy protection." = "A(z) „%1$@” „%2$@” Audio Unit arról számolt be, hogy nincs megfelelően hitelesítve a rendszer használatához.\nA másolásvédelemmel kapcsolatos bővebb információkért olvassa át a plugin dokumentációját.";

/* alert text */
"The Audio Unit “%@” by “%@” reports that it is not properly authorized to be used on this system.\nPlease check the plug-in’s documentation for more information about its copy protection. You may open the plug-in’s graphic interface now for managing copy protection." = "A(z) „%1$@” „%2$@” hangegysége arról számolt be, hogy nincs megfelelően hitelesítve a rendszer használatához.\nA másolásvédelemmel kapcsolatos bővebb információkért olvassa át a plugin dokumentációját. A másolásvédelmet a plugin grafikus felületén állíthatja be.";

/* alert text */
"While verifying Audio Unit compatibility, ^P encountered %ld Audio Unit plug-in(s) which did not pass the Apple AU validation. These plug-ins have been excluded from further usage in ^P to prevent possible problems or crashes. You can start the Plug-In Manager now to review the validation results or continue the startup process." = "Az Audio Units kompatibilitásának ellenőrzése közben a(z) ^P %ld olyan Audio Unit-plugint talált, amelyek nem felelnek meg az Apple AU-érvényesítési feltételeknek. Ezek a pluginok ki lettek zárva a további használatból a(z) ^P alkalmazásban, az esetleges problémák vagy összeomlások elkerülése érdekében. Most elindíthatja a Pluginkezelőt, hogy újra áttekintse az érvényesítési eredményeket, vagy folytassa az indítási folyamatot.";

/* alert text */
"^P unexpectedly quit while trying to use the Audio Unit “%@” by “%@”.\nThis plug-in may require an update." = "A(z) ^P váratlanul leállt, miközben megpróbálta használni a(z) „%2$@” „%1$@” Audio Unitot.\nElőfordulhat, hogy ezt a plugint frissíteni kell.";

/* alert title */
"An error has occurred with an installed Audio Unit plug-in." = "Egy telepített Audio Unit-pluginnal kapcsolatos hiba történt.";

/* alert title */
"Audio Unit authorization error." = "Audio Unit engedélyezései hibája.";

/* alert title */
"Incompatible Audio Units found." = "A rendszer inkompatibilis Audio Units elemeket talált";

/* alert title */
"You are about to abort the scan process." = "Meg fogja szakítani a vizsgálati folyamatot.";

/* alert title */
"You are using incompatible Audio Units." = "Inkompatibilis Audio Units elemeket használ.";

/* audio unit type */
"MIDI processor" = "MIDI-processzor";

/* audio unit type */
"MIDI-controlled effect" = "MIDI-vezérelt effekt";

/* audio unit type */
"effect" = "effektus";

/* audio unit type */
"format converter" = "formátumátalakító";

/* audio unit type */
"generator" = "létrehozó";

/* audio unit type */
"instrument" = "hangszer";

/* audio unit type */
"mixer" = "keverő";

/* audio unit type */
"offline effect" = "offline effektus";

/* audio unit type */
"output unit" = "kimeneti egység";

/* audio unit type */
"panner" = "hangúsztató";

/* message while starting up */
"Searching for Audio Unit plug-ins…" = "Audio Unit-pluginok keresése…";

/* message while starting up */
"Updating information about Audio Unit plug-ins…" = "Az Audio Unit-pluginok információinak frissítése…";

/* possible validation result */
"couldn’t be opened" = "nem lehetett megnyitni";

/* possible validation result */
"crashed validation" = "az érvényesítés összeomlott";

/* possible validation result */
"failed validation" = "sikertelen érvényesítés";

/* possible validation result */
"not authorized" = "nincs hitelesített";

/* possible validation result */
"not validated due to internal error" = "belső hiba miatt nem érvényesített";

/* possible validation result */
"not yet validated" = "még nem érvényes";

/* possible validation result */
"successfully validated" = "sikeresen érvényesített";

/* progress dialog text */
"Scanning Audio Units (finalized %d of %d)" = "Audio Units elemek vizsgálata (%2$d/%1$d véglegesített)";

/* progress dialog text */
"Scanning Audio Units (finalized %ld of %ld)" = "Audio Units elemek vizsgálata (%2$ld/%1$ld véglegesített)";

/* used for invalid version numbers */
"invalid" = "érvénytelen";

/* used when value transformer can’t interpret given object */
"unknown" = "ismeretlen";
